20230819074153-networking.org
:PROPERTIES:
:ID:       81cf9704-e90a-4565-9337-3304436a50c2
:END:
#+title: Networking

Computers on a network have an identifier called an [[id:1011a8fb-ad00-40bb-a1cc-4b53c9fedff0][IP Address]].

Devices that can connect to a network have another unique identifier called a [[id:5b075cfc-c900-4457-8811-27152afd5245][MAC Address]].

When you send or receive data through a network, you need to have both an [[id:1011a8fb-ad00-40bb-a1cc-4b53c9fedff0][IP Address]] and a MAC address.

* [[id:2bbeeafb-6aeb-4b88-a73e-55376208623e][Networking Hardware]]
* [[id:6b0e0e04-c938-4f1f-bc40-51f228a3cdd7][TCP/IP]]
* [[id:7f6ccd08-47a2-4528-966d-3e08b8b40755][URL]]
* Domains
Domain name registered with [[id:fee02162-33e4-4876-a97d-1101add203d4][ICANN]].
[[id:8af929df-eab6-4a08-a5ab-fcd7460923d7][DNS]]
[[id:094c71e5-7e0e-4d74-bad2-880a48eba1ad][NAT]]
[[id:ac8ef205-f514-46cd-bf43-b2e8946cb971][DARPA]]

* Models
** [[id:f99c3392-1605-49dc-ba45-15f69dc69bf9][5 Layer Network Model]]
** [[id:1cf82296-4c1c-4659-b255-20b987bc07fe][OSI Network Model]]

The primary difference between the =five layer= model and the seven layer =OSI= model is that the =OSI= model abstracts the application layer into three layers total.

* Casting
At the [[id:958904bc-6a62-45e5-a508-9f996ca87212][Network Layer]], looking at a =special bit= in the [[id:5b075cfc-c900-4457-8811-27152afd5245][MAC Address]].

** 1. [[id:a983d5a3-cdfc-4c8c-98cb-a5656259506a][Unicast]]
If the =least significant bit= in the *first* Octet of a destination address is set to *0*,
It means that [[id:73b06fc5-e631-40ad-828f-741dd84bd15c][Ethernet Frame]] is intended for *only the destination address*.

** 2. [[id:c4309265-ff27-4592-85f6-3ed4ea47fc18][Multicast]]
If the =least significant bit= in the *first* Octet of a destination address is set to *1*,
It means that [[id:73b06fc5-e631-40ad-828f-741dd84bd15c][Ethernet Frame]] is intended for *a set of destination addresses*.

** 3. [[id:07f12bda-2f73-4fe3-9570-6734585201e6][Broadcast]]

* [[id:04f17f82-16fd-41fd-8653-2a13ed7d0c2a][Subnets]]
* [[id:d53a9a75-6a81-4c6f-87ca-82495deb5443][Router Protocols]]
* [[id:39c95354-f3b6-4a37-8a65-d9bcd89f5490][Firewall]]
* [[id:85b13f49-8efe-4a26-ab1f-5f460497f49f][Dynamic Host Configuration Protocol]]
* [[id:ed12ba59-060c-4be7-b24d-91754663a9be][Virtual Private Network]]
* [[id:cfad14e6-8b52-45da-a016-9ca6b5369f57][Proxy Services]]
* [[id:f55ee4da-5c0a-415c-afb6-49140fe309c8][Reverse Proxy Service]]

* [[id:df3d0f90-3b14-4ac1-a552-2cad929c9fb1][Connecting To The Internet]]

* [[id:9019c275-0ec8-4346-8d37-c44ac8f7f48e][Network Troubleshooting]]

* [[id:1af8ebf4-5413-4c6c-a024-7b0b140ed534][Hosts file]]
* [[id:471cf7c8-266f-49c6-b643-3b1540d47675][Loopback Address]]

* [[id:fd1bd7fc-a91a-4a78-b4a4-e54febb82090][Cloud Computing]]

[[id:6f0bd7d5-45b5-4f03-8546-92504c6d4669][IPv4 Mapped Address Space]]

[[id:ad12a56d-dda5-4405-8a7b-5c32f04a760b][Intranet]]
[[id:333e0447-8fd7-48d5-b614-bac79a58da40][Extranet]]
[[id:081f5322-25ef-456e-a6b7-bd57130aed81][Proxy Server]]
