20230819074153-networking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Networking</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Networking</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org54c22c1">1. Networking Hardware</a></li>
<li><a href="#orga3fcd39">2. TCP/IP</a></li>
<li><a href="#orgbb2abf4">3. URL</a></li>
<li><a href="#orgcce884e">4. Domains</a></li>
<li><a href="#orgef94348">5. Models</a>
<ul>
<li><a href="#orgd6d1914">5.1. 5 Layer Network Model</a></li>
<li><a href="#org9eedd4d">5.2. OSI Network Model</a></li>
</ul>
</li>
<li><a href="#org433a957">6. Casting</a>
<ul>
<li><a href="#org7fcd363">6.1. 1. Unicast</a></li>
<li><a href="#org52ace75">6.2. 2. Multicast</a></li>
<li><a href="#org217caf4">6.3. 3. Broadcast</a></li>
</ul>
</li>
<li><a href="#org80feded">7. Subnets</a></li>
<li><a href="#org41dc77e">8. Router Protocols</a></li>
<li><a href="#org00d3ad6">9. Firewall</a></li>
<li><a href="#orgd8d6ed5">10. Dynamic Host Configuration Protocol</a></li>
<li><a href="#orge27b53a">11. Virtual Private Network</a></li>
<li><a href="#org9c0030d">12. Proxy Services</a></li>
<li><a href="#org1cc4da9">13. Reverse Proxy Service</a></li>
<li><a href="#org5ee17d2">14. Connecting To The Internet</a></li>
<li><a href="#orgec309be">15. Network Troubleshooting</a></li>
<li><a href="#orgd56851e">16. Hosts file</a></li>
<li><a href="#orgcf7de35">17. Loopback Address</a></li>
<li><a href="#orge332024">18. Cloud Computing</a>
<ul>
<li><a href="#orgcd2ca2f">18.1. Protocols</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Computers on a network have an identifier called an <a href="20230819074635-ip_address.html#ID-1011a8fb-ad00-40bb-a1cc-4b53c9fedff0">IP Address</a>.
</p>

<p>
Devices that can connect to a network have another unique identifier called a <a href="20230819074730-mac_address.html#ID-5b075cfc-c900-4457-8811-27152afd5245">MAC Address</a>.
</p>

<p>
When you send or receive data through a network, you need to have both an <a href="20230819074635-ip_address.html#ID-1011a8fb-ad00-40bb-a1cc-4b53c9fedff0">IP Address</a> and a MAC address.
</p>

<div id="outline-container-org54c22c1" class="outline-2">
<h2 id="org54c22c1"><span class="section-number-2">1.</span> <a href="20230819075402-networking_hardware.html#ID-2bbeeafb-6aeb-4b88-a73e-55376208623e">Networking Hardware</a></h2>
</div>
<div id="outline-container-orga3fcd39" class="outline-2">
<h2 id="orga3fcd39"><span class="section-number-2">2.</span> <a href="20230819075956-tcp_ip.html#ID-6b0e0e04-c938-4f1f-bc40-51f228a3cdd7">TCP/IP</a></h2>
</div>
<div id="outline-container-orgbb2abf4" class="outline-2">
<h2 id="orgbb2abf4"><span class="section-number-2">3.</span> <a href="20230819080412-uniform_resource_locator_url.html#ID-7f6ccd08-47a2-4528-966d-3e08b8b40755">URL</a></h2>
</div>
<div id="outline-container-orgcce884e" class="outline-2">
<h2 id="orgcce884e"><span class="section-number-2">4.</span> Domains</h2>
<div class="outline-text-2" id="text-4">
<p>
Domain name registered with <a href="20230819080536-internet_corporation_for_assigned_names_and_numbers_icann.html#ID-fee02162-33e4-4876-a97d-1101add203d4">ICANN</a>.
<a href="20230819080710-domain_name_system_dns.html#ID-8af929df-eab6-4a08-a5ab-fcd7460923d7">DNS</a>
<a href="20230819081842-network_address_translation_nat.html#ID-094c71e5-7e0e-4d74-bad2-880a48eba1ad">NAT</a>
<a href="20230819083141-defense_advanced_research_projects_agency_darpa.html#ID-ac8ef205-f514-46cd-bf43-b2e8946cb971">DARPA</a>
</p>
</div>
</div>

<div id="outline-container-orgef94348" class="outline-2">
<h2 id="orgef94348"><span class="section-number-2">5.</span> Models</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd6d1914" class="outline-3">
<h3 id="orgd6d1914"><span class="section-number-3">5.1.</span> <a href="20230820071530-5_layer_network_model.html#ID-f99c3392-1605-49dc-ba45-15f69dc69bf9">5 Layer Network Model</a></h3>
</div>
<div id="outline-container-org9eedd4d" class="outline-3">
<h3 id="org9eedd4d"><span class="section-number-3">5.2.</span> <a href="20230820073555-osi_network_model.html#ID-1cf82296-4c1c-4659-b255-20b987bc07fe">OSI Network Model</a></h3>
<div class="outline-text-3" id="text-5-2">
<p>
The primary difference between the <code>five layer</code> model and the seven layer <code>OSI</code> model is that the <code>OSI</code> model abstracts the application layer into three layers total.
</p>
</div>
</div>
</div>

<div id="outline-container-org433a957" class="outline-2">
<h2 id="org433a957"><span class="section-number-2">6.</span> Casting</h2>
<div class="outline-text-2" id="text-6">
<p>
At the <a href="20230820072546-network_layer.html#ID-958904bc-6a62-45e5-a508-9f996ca87212">Network Layer</a>, looking at a <code>special bit</code> in the <a href="20230819074730-mac_address.html#ID-5b075cfc-c900-4457-8811-27152afd5245">MAC Address</a>.
</p>
</div>

<div id="outline-container-org7fcd363" class="outline-3">
<h3 id="org7fcd363"><span class="section-number-3">6.1.</span> 1. <a href="20230821054541-unicast.html#ID-a983d5a3-cdfc-4c8c-98cb-a5656259506a">Unicast</a></h3>
<div class="outline-text-3" id="text-6-1">
<p>
If the <code>least significant bit</code> in the <b>first</b> Octet of a destination address is set to <b>0</b>,
It means that <a href="20230821055442-ethernet_frame.html#ID-73b06fc5-e631-40ad-828f-741dd84bd15c">Ethernet Frame</a> is intended for <b>only the destination address</b>.
</p>
</div>
</div>

<div id="outline-container-org52ace75" class="outline-3">
<h3 id="org52ace75"><span class="section-number-3">6.2.</span> 2. <a href="20230821054705-multicast.html#ID-c4309265-ff27-4592-85f6-3ed4ea47fc18">Multicast</a></h3>
<div class="outline-text-3" id="text-6-2">
<p>
If the <code>least significant bit</code> in the <b>first</b> Octet of a destination address is set to <b>1</b>,
It means that <a href="20230821055442-ethernet_frame.html#ID-73b06fc5-e631-40ad-828f-741dd84bd15c">Ethernet Frame</a> is intended for <b>a set of destination addresses</b>.
</p>
</div>
</div>

<div id="outline-container-org217caf4" class="outline-3">
<h3 id="org217caf4"><span class="section-number-3">6.3.</span> 3. <a href="20230821055220-broadcast.html#ID-07f12bda-2f73-4fe3-9570-6734585201e6">Broadcast</a></h3>
</div>
</div>

<div id="outline-container-org80feded" class="outline-2">
<h2 id="org80feded"><span class="section-number-2">7.</span> <a href="20230821071819-subnets.html#ID-04f17f82-16fd-41fd-8653-2a13ed7d0c2a">Subnets</a></h2>
</div>
<div id="outline-container-org41dc77e" class="outline-2">
<h2 id="org41dc77e"><span class="section-number-2">8.</span> <a href="20230821075608-router_protocols.html#ID-d53a9a75-6a81-4c6f-87ca-82495deb5443">Router Protocols</a></h2>
</div>
<div id="outline-container-org00d3ad6" class="outline-2">
<h2 id="org00d3ad6"><span class="section-number-2">9.</span> <a href="20230822080913-firewall.html#ID-39c95354-f3b6-4a37-8a65-d9bcd89f5490">Firewall</a></h2>
</div>
<div id="outline-container-orgd8d6ed5" class="outline-2">
<h2 id="orgd8d6ed5"><span class="section-number-2">10.</span> <a href="20230821064330-dynamic_host_configuration_protocol.html#ID-85b13f49-8efe-4a26-ab1f-5f460497f49f">Dynamic Host Configuration Protocol</a></h2>
</div>
<div id="outline-container-orge27b53a" class="outline-2">
<h2 id="orge27b53a"><span class="section-number-2">11.</span> <a href="20230823060450-virtual_private_network.html#ID-ed12ba59-060c-4be7-b24d-91754663a9be">Virtual Private Network</a></h2>
</div>
<div id="outline-container-org9c0030d" class="outline-2">
<h2 id="org9c0030d"><span class="section-number-2">12.</span> <a href="20230823060935-proxy_services.html#ID-cfad14e6-8b52-45da-a016-9ca6b5369f57">Proxy Services</a></h2>
</div>
<div id="outline-container-org1cc4da9" class="outline-2">
<h2 id="org1cc4da9"><span class="section-number-2">13.</span> <a href="20230823061219-reverse_proxy_service.html#ID-f55ee4da-5c0a-415c-afb6-49140fe309c8">Reverse Proxy Service</a></h2>
</div>

<div id="outline-container-org5ee17d2" class="outline-2">
<h2 id="org5ee17d2"><span class="section-number-2">14.</span> <a href="20230823173615-connecting_to_the_internet.html#ID-df3d0f90-3b14-4ac1-a552-2cad929c9fb1">Connecting To The Internet</a></h2>
</div>

<div id="outline-container-orgec309be" class="outline-2">
<h2 id="orgec309be"><span class="section-number-2">15.</span> <a href="20230823174155-network_troubleshooting.html#ID-9019c275-0ec8-4346-8d37-c44ac8f7f48e">Network Troubleshooting</a></h2>
</div>

<div id="outline-container-orgd56851e" class="outline-2">
<h2 id="orgd56851e"><span class="section-number-2">16.</span> <a href="20230823181328-host_file.html#ID-1af8ebf4-5413-4c6c-a024-7b0b140ed534">Hosts file</a></h2>
</div>
<div id="outline-container-orgcf7de35" class="outline-2">
<h2 id="orgcf7de35"><span class="section-number-2">17.</span> <a href="20230823181528-loopback_address.html#ID-471cf7c8-266f-49c6-b643-3b1540d47675">Loopback Address</a></h2>
</div>

<div id="outline-container-orge332024" class="outline-2">
<h2 id="orge332024"><span class="section-number-2">18.</span> <a href="20230823192304-cloud_computing.html#ID-fd1bd7fc-a91a-4a78-b4a4-e54febb82090">Cloud Computing</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<a href="20230823194831-ipv4_mapped_address_space.html#ID-6f0bd7d5-45b5-4f03-8546-92504c6d4669">IPv4 Mapped Address Space</a>
</p>

<p>
<a href="20230826074404-intranet.html#ID-ad12a56d-dda5-4405-8a7b-5c32f04a760b">Intranet</a>
<a href="20230826074425-extranet.html#ID-333e0447-8fd7-48d5-b614-bac79a58da40">Extranet</a>
<a href="20230826074446-proxy_server.html#ID-081f5322-25ef-456e-a6b7-bd57130aed81">Proxy Server</a>
</p>
</div>

<div id="outline-container-orgcd2ca2f" class="outline-3">
<h3 id="orgcd2ca2f"><span class="section-number-3">18.1.</span> Protocols</h3>
<div class="outline-text-3" id="text-18-1">
<p>
<a href="20230826074103-network_protocols.html#ID-7e14f158-2e7b-4b56-a8f5-58ba7f3b74de">Network Protocols</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
